app/controllers/pages_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
---
  def show
    @page = Page.find(params[:id])

SELECT * FROM `pages` WHERE (`pages`.questionnaire_id = 1) ORDER BY position
SELECT `questions`.* FROM `questions` WHERE (`questions`.page_id = 1) ORDER BY position
SELECT `special_field_associations`.* FROM `special_field_associations` WHERE (`special_field_associations`.question_id IN (2,3))
---
  def edit
    @page = Page.find(params[:id], :include => {:questions => :special_field_association})

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
UPDATE `pages` SET `title` = 'pagina' WHERE `id` = 1
---
  def update
    @page = Page.find(params[:id])
    check_forged_path

    respond_to do |format|
      if @page.update_attributes(params[:page])