app/controllers/questions_controller.rb

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
---
  def show
    @question = Question.find(params[:id])

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
---
  def edit
    @question = Question.find(params[:id])

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
SELECT * FROM `questions` WHERE (page_id = 1) ORDER BY position DESC LIMIT 1
INSERT INTO `questions` (`position`, `required`, `step`, `layout`, `max`, `page_id`, `type`, `caption`, `min`, `default_answer`) VALUES(1, 0, 1, 'left', 0, 1, '', '', 0, NULL)
SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
UPDATE `questions` SET `caption` = 'Pulse aqu’ para escribir una pregunta' WHERE `id` = 1
---
  def create
    purpose = params[:question].delete(:purpose)
    @question = Question.new(params[:question])
    @question.caption ||= ""
    @question.page = @page

    respond_to do |format|
      if @question.save and @question.update_attribute(:type, params[:question][:type])
        if purpose
          SpecialFieldAssociation.create :question => @question, :purpose => purpose, :questionnaire => @questionnaire
        end

        @question = Question.find(@question.id)
        if @question.kind_of? Questions::Field and @question.caption.blank?
          # get the default field caption in
          @question.caption = "Pulse aqu’ para escribir una pregunta"
          @question.save

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
UPDATE `questions` SET `default_answer` = '', `caption` = 'titulo del cuestionario' WHERE `id` = 1
---
  def update
    @question = Question.find(params[:id])
    check_forged_path

    respond_to do |format|
      if @question.update_attributes(params[:question])

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
DELETE FROM `questions` WHERE `id` = 1
---
  def destroy
    @question = Question.find(params[:id])
    check_forged_path
    @question.destroy