app/controllers/questionnaires_controller.rb

  def index
    #p = logged_in? ? logged_in_person : nil
    per_page = 12
    conditions = []
    condition_vars = {}
    if params[:title] and params[:title] != ''
      conditions.push("lower(title) like :title")
      condition_vars[:title] ="%#{params[:title].downcase}%"
    end
    find_conditions = [conditions.join(" and "), condition_vars]
    permitted_questionnaires = Questionnaire.all(:conditions => find_conditions, :order => 'id DESC')
---
SELECT * FROM `questionnaires` ORDER BY id DESC

  def show
    @questionnaire = Questionnaire.find(params[:id])
---
SELECT * FROM `questionnaires` WHERE (`questionnaires`.`id` = 1)

  def print
    @questionnaire = Questionnaire.find(params[:id], :include => :pages)
---
SELECT * FROM `questionnaires` WHERE (`questionnaires`.`id` = 1)
SELECT `pages`.* FROM `pages` WHERE (`pages`.questionnaire_id = 1) ORDER BY position

  def new
    @questionnaire = Questionnaire.new

    #@roles = logged_in_person.roles
    #perm_conds = "permission = 'edit' and (person_id = #{logged_in_person.id}"
    #if @roles.length > 0
    #  perm_conds << " OR role_id IN (#{@roles.collect {|r| r.id}.join(",")})"
    #end
    #perm_conds << ")"

    @cloneable_questionnaires = Questionnaire.all(:order => "id DESC")#,
                                        #:conditions => perm_conds, :joins => :permissions).uniq
---
SELECT * FROM `questionnaires` ORDER BY id DESC

  def edit
    #@questionnaire = Questionnaire.find(params[:id], :include => [:permissions, :pages])
    @questionnaire = Questionnaire.find(params[:id], :include => [:pages])
---
SELECT * FROM `questionnaires` WHERE (`questionnaires`.`id` = 1)
SELECT `pages`.* FROM `pages` WHERE (`pages`.questionnaire_id = 1) ORDER BY position

  def export
    #@questionnaire = Questionnaire.find(params[:id], :include => [:permissions])
        @questionnaire = Questionnaire.find(params[:id])
---
SELECT * FROM `questionnaires` WHERE (`questionnaires`.`id` = 1)

  def create
    if params[:file]
      begin
        @questionnaire = Questionnaire.from_xml(params[:file].read)
        #logger.debug @questionnaire.taggings
      rescue Exception => ex
        flash[:error_messages] = ["There was an error parsing the JQML file you uploaded.  Please check to make sure it is a valid JQML file."]
        m = ex.message.to_s
        if m.length < 500
          flash[:error_messages] << m
        end
        redirect_to :action => "index"
        return
      end
    elsif params[:clone_questionnaire_id]
      @questionnaire = Questionnaire.find(params[:clone_questionnaire_id]).deepclone
      @questionnaire.title = "Copy of #{@questionnaire.title}"
      @questionnaire.is_open = false
    else
      p = params[:questionnaire] || {}
      p[:title] ||= "Untitled questionnaire"
      @questionnaire = Questionnaire.new(p)
    end

    respond_to do |format|
      if @questionnaire.save
---
INSERT INTO `questionnaires` (`is_open`, `allow_preview`, `allow_delete_responses`, `custom_css`, `created_at`, `title`, `allow_finish_later`, `rss_secret`, `publicly_visible`, `custom_html`, `updated_at`, `require_login`, `published_at`, `advertise_login`, `allow_amend_response`, `welcome_text`) VALUES(NULL, 0, 0, '', '2011-06-08 08:55:27', 'prueba cuestionario', 1, NULL, 1, '', '2011-06-08 08:55:27', 0, NULL, 1, 1, NULL)

  def update
    @questionnaire = Questionnaire.find(params[:id])

    respond_to do |format|
      if @questionnaire.update_attributes(params[:questionnaire])
---
SELECT * FROM `questionnaires` WHERE (`questionnaires`.`id` = 1)
UPDATE `questionnaires` SET `updated_at` = '2011-06-08 08:55:39', `title` = 'modificando titulo' WHERE `id` = 1